#include<stdio.h>//本题就是在找1，妥善的处理每一个1就会得出正确的结果
void jia(int *a,int x,int y){//
if(a[x]==2){//如果是2，果断加1,3得出的乘积比1+1=2大
a[x]++;
return;
}
if(a[x]==0) x--;//当有2的时候会在前面出现一个0，那么就把标记移动到前面的那个3上
a[x]<=a[y]?a[x]++:a[y]++;//优先向左加，因为是从左向右贪心，那么右面所出现的东西是未知的，所以向左加，比如4 1 4 1
}
int a[10002];
int main(){
int i,sum,n;
while(scanf("%d",&n)!=EOF){
for(i=0; i<n; i++) scanf("%d",&a[i]);
if(a[0]==1&&n>1) a[1]++,a[0]=0;//如果第一个数是1，那么就让他后面的数加1，自己变成0
for(i=1; i<n-1; i++)
if(a[i]==1) a[i]=0,jia(a,i-1,i+1);//有1执行那个函数
if(a[n-1]==1&&n>1){//最后一个数如果是1那么只能往前找一个数加上
for(i=n-2; !a[i]; i--);
a[i]++;
a[n-1]=0;
}
for(i=0,sum=1; i<n; i++)
if(a[i]) sum=(sum*a[i])%10086;//相乘
printf("%d\n",sum);
}
}
